{
  "backend/main.mo": "Main ICP actor implementing a full e-commerce backend with user profiles, product CRUD, shopping cart, and order management, all protected by role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report mapping implemented features (catalog, product detail, cart, checkout, order history) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing their purpose and key functionality for build planning reference.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, primary, card, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'Solano7m', mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (home, catalog, product detail, cart, checkout, order success, orders), wraps the app in ThemeProvider and Toaster, and conditionally shows the profile setup modal.",
  "frontend/src/components/Layout.tsx": "Full-page layout component providing a sticky header with logo, navigation links, cart badge, Internet Identity auth button, responsive mobile menu, and a branded footer.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card with image, category badge, price, and an 'Add to Cart' button that requires authentication, using TanStack Router for navigation and Sonner for toast notifications.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal dialog prompting new users to enter their name and save their profile via the `useSaveCallerUserProfile` mutation; the modal cannot be dismissed without submitting.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using TanStack Query, reinitializing it when the Internet Identity changes and invalidating all dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functionality, persisting identity across page reloads via DFINITY's AuthClient and exposing status flags through a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend interactions including user profile, products, cart, and orders, wrapping actor calls in typed queries and mutations with cache invalidation.",
  "frontend/src/index.css": "Defines global styles using Tailwind CSS, including a warm earthy OKLCH color palette for light and dark themes, and imports Playfair Display and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart page with item rows showing product images, quantity controls, and line totals, using cart mutation hooks to update or remove items.",
  "frontend/src/pages/CatalogPage.tsx": "Displays a product catalog with a hero banner, search input, and category filter badges, rendering filtered product cards or skeletons while loading.",
  "frontend/src/pages/CheckoutPage.tsx": "Shows an order summary of cart items with a grand total and a place-order button, navigating to the success page on completion or prompting sign-in if unauthenticated.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section, a three-feature highlights grid (curated selection, secure shopping, fast delivery), and a call-to-action banner linking to the catalog.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Lists the authenticated user's past orders as cards with status badges, item details, timestamps, and totals, fetched via order and product query hooks.",
  "frontend/src/pages/OrderSuccessPage.tsx": "Static confirmation page displayed after a successful order, showing the order ID and navigation links to order history and the catalog.",
  "frontend/src/pages/ProductDetailPage.tsx": "React page component that displays full product details (image, price, stock, description) fetched by ID, with quantity selection and an Add to Cart button that requires authentication.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to extract, persist, and clear URL parameters from both query strings and hash-based routes, using sessionStorage for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Playfair Display, Inter), an oklch-based color palette (terracotta, cream, charcoal, and semantic tokens), and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest tracking the e-commerce app 'Solano7m', listing existing implemented features (catalog, product detail, cart, checkout, order history, theming, static assets) and required image assets."
}