{
  "kind": "build_request",
  "title": "Add Admin Panel for Product Management",
  "projectName": "Solano7m",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Add a backend function to register or designate a specific principal as an admin. Ensure the existing role-based access control (admin/user) in the backend actor is used to gate all product CRUD operations so only admin principals can add, edit, or delete products.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Okay please add me in admin panel"
        ]
      },
      "acceptanceCriteria": [
        "A designated principal can be set as admin in the backend actor.",
        "Non-admin principals are rejected when calling product create/update/delete endpoints.",
        "The currently authenticated user (the app owner) is granted admin role."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Build an Admin Panel page at /admin accessible only to authenticated users with the admin role. The page must include: a product list table showing all products (name, category, price, stock), an 'Add Product' form (name, description, price, category, stock quantity, image URL), an 'Edit Product' form pre-populated with existing product data, and a 'Delete Product' button with confirmation. Non-admin users who visit /admin should see an access-denied message.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Okay please add me in admin panel"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /admin while unauthenticated or as a non-admin shows an access-denied screen.",
        "Admin users see a full product list table with edit and delete actions per row.",
        "Admin users can add a new product via a form; the product appears in the catalog after submission.",
        "Admin users can edit an existing product; changes are reflected in the catalog.",
        "Admin users can delete a product with a confirmation prompt; the product is removed from the catalog.",
        "The admin panel matches the app's warm earthy visual theme."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add an 'Admin' navigation link in the app header (Layout.tsx) that is visible only when the authenticated user has the admin role, linking to /admin.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Okay please add me in admin panel"
        ]
      },
      "acceptanceCriteria": [
        "The Admin link is not visible to unauthenticated users or non-admin users.",
        "The Admin link is visible in the header for admin users and navigates to /admin."
      ]
    }
  ],
  "constraints": [
    "All Motoko logic must remain in backend/main.mo as a single actor.",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Admin access must be enforced on the backend, not just on the frontend."
  ],
  "nonGoals": [
    "Building a separate multi-user admin role management UI.",
    "Uploading image files directly — image URLs are used instead.",
    "Generating an APK or mobile app."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}