{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Admin Panel for Product Management",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Build an Admin Panel page at /admin with product management capabilities (list, add, edit, delete) accessible only to authenticated admin users",
      "acceptanceCriteria": [
        "Navigating to /admin while unauthenticated or as a non-admin shows an access-denied screen.",
        "Admin users see a full product list table with edit and delete actions per row.",
        "Admin users can add a new product via a form; the product appears in the catalog after submission.",
        "Admin users can edit an existing product; changes are reflected in the catalog.",
        "Admin users can delete a product with a confirmation prompt; the product is removed from the catalog.",
        "The admin panel matches the app's warm earthy visual theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add TanStack Query mutations for product CRUD operations: useCreateProduct (calls createProduct), useUpdateProduct (calls updateProduct), useDeleteProduct (calls deleteProduct), and useIsCallerAdmin query (calls isCallerAdmin). Each mutation should invalidate the 'products' query key on success. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "create",
          "description": "Create the Admin Panel page component that checks admin status using useIsCallerAdmin hook. If not admin or not authenticated, display an access-denied message. For admin users, render a product management interface with: a table listing all products (using useListProducts) showing name, category, price, stock with edit/delete actions per row; an 'Add Product' form with fields for name, description, price, category, stock quantity, and image URL; an inline or modal 'Edit Product' form pre-populated with selected product data; and a delete confirmation dialog. Use the product CRUD mutation hooks. Apply the app's warm earthy color theme using Tailwind classes matching frontend/src/index.css and frontend/tailwind.config.js tokens. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new route for /admin that renders the AdminPage component. Import AdminPage and register the route in the TanStack Router configuration alongside existing routes (home, catalog, product detail, cart, checkout, order success, orders)."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add conditional rendering of an 'Admin' navigation link in the header that is visible only when the user is authenticated and has admin role (using useIsCallerAdmin hook). Place the Admin link in the navigation menu before or after existing links, and ensure it links to /admin. The link should respect the responsive mobile menu behavior. Verify the authorization component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Add an 'Admin' navigation link in the app header visible only to authenticated admin users",
      "acceptanceCriteria": [
        "The Admin link is not visible to unauthenticated users or non-admin users.",
        "The Admin link is visible in the header for admin users and navigates to /admin."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "This requirement is already covered by REQ-12's Layout.tsx modification. Ensure the Admin link implementation checks both authentication status (from useInternetIdentity) and admin role (from useIsCallerAdmin) before displaying the link."
        }
      ]
    }
  ]
}